; domain
; remove negative-precondition for powerlifted
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
    (:requirements :typing :strips)
    ; (:requirements :typing :strips :negative-preconditions)
    (:types
        car - object
        location - object
    )

    (:predicates
        (at-ferry ?l - location)
        (at ?c - car ?l - location)
        (empty-ferry)
        (on ?c - car)
    )

    (:action sail
        :parameters (?from - location ?to - location)
        :precondition (and
            (at-ferry ?from)
            ; (not (at-ferry ?to))
        )
        :effect (and (at-ferry ?to) (not (at-ferry ?from)))
    )

    (:action board
        :parameters (?car - car ?loc - location)
        :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
        :effect (and
            (on ?car)
            (not (at ?car ?loc))
            (not (empty-ferry)))
    )

    (:action debark
        :parameters (?car - car ?loc - location)
        :precondition (and (on ?car) (at-ferry ?loc))
        :effect (and
            (at ?car ?loc)
            (empty-ferry)
            (not (on ?car)))
    )
)

; problem
;; cars=19, locations=15, out_folder=training/easy, instance_id=94, seed=124

(define (problem ferry-94)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc5)
    (at car1 loc9)
    (at car2 loc1)
    (at car3 loc3)
    (at car4 loc1)
    (at car5 loc7)
    (at car6 loc5)
    (at car7 loc13)
    (at car8 loc6)
    (at car9 loc1)
    (at car10 loc6)
    (at car11 loc3)
    (at car12 loc7)
    (at car13 loc5)
    (at car14 loc14)
    (at car15 loc7)
    (at car16 loc1)
    (at car17 loc9)
    (at car18 loc8)
    (at car19 loc10)
)
 (:goal  (and (at car1 loc7)
   (at car2 loc2)
   (at car3 loc5)
   (at car4 loc5)
   (at car5 loc2)
   (at car6 loc8)
   (at car7 loc6)
   (at car8 loc4)
   (at car9 loc4)
   (at car10 loc8)
   (at car11 loc5)
   (at car12 loc14)
   (at car13 loc15)
   (at car14 loc11)
   (at car15 loc6)
   (at car16 loc10)
   (at car17 loc5)
   (at car18 loc14)
   (at car19 loc7))))

; plan
1. (sail loc5 loc9)
   deleted: (at-ferry loc5)
   added: (at-ferry loc9)
   goals met: 0 of 19
2. (board car1 loc9)
   deleted: (at car1 loc9) (empty-ferry)
   added: (on car1)
   goals met: 0 of 19
3. (sail loc9 loc7)
   deleted: (at-ferry loc9)
   added: (at-ferry loc7)
   goals met: 0 of 19
4. (debark car1 loc7)
   deleted: (on car1)
   added: (at car1 loc7) (empty-ferry)
   goals met: 1 of 19
5. (sail loc7 loc1)
   deleted: (at-ferry loc7)
   added: (at-ferry loc1)
   goals met: 1 of 19
6. (board car2 loc1)
   deleted: (at car2 loc1) (empty-ferry)
   added: (on car2)
   goals met: 1 of 19
7. (sail loc1 loc2)
   deleted: (at-ferry loc1)
   added: (at-ferry loc2)
   goals met: 1 of 19
8. (debark car2 loc2)
   deleted: (on car2)
   added: (at car2 loc2) (empty-ferry)
   goals met: 2 of 19
9. (sail loc2 loc3)
   deleted: (at-ferry loc2)
   added: (at-ferry loc3)
   goals met: 2 of 19
10. (board car3 loc3)
   deleted: (at car3 loc3) (empty-ferry)
   added: (on car3)
   goals met: 2 of 19
11. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 2 of 19
12. (debark car3 loc5)
   deleted: (on car3)
   added: (at car3 loc5) (empty-ferry)
   goals met: 3 of 19
13. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 3 of 19
14. (board car4 loc1)
   deleted: (at car4 loc1) (empty-ferry)
   added: (on car4)
   goals met: 3 of 19
15. (sail loc1 loc5)
   deleted: (at-ferry loc1)
   added: (at-ferry loc5)
   goals met: 3 of 19
16. (debark car4 loc5)
   deleted: (on car4)
   added: (at car4 loc5) (empty-ferry)
   goals met: 4 of 19
17. (sail loc5 loc7)
   deleted: (at-ferry loc5)
   added: (at-ferry loc7)
   goals met: 4 of 19
18. (board car5 loc7)
   deleted: (at car5 loc7) (empty-ferry)
   added: (on car5)
   goals met: 4 of 19
19. (sail loc7 loc2)
   deleted: (at-ferry loc7)
   added: (at-ferry loc2)
   goals met: 4 of 19
20. (debark car5 loc2)
   deleted: (on car5)
   added: (at car5 loc2) (empty-ferry)
   goals met: 5 of 19
21. (sail loc2 loc5)
   deleted: (at-ferry loc2)
   added: (at-ferry loc5)
   goals met: 5 of 19
22. (board car6 loc5)
   deleted: (at car6 loc5) (empty-ferry)
   added: (on car6)
   goals met: 5 of 19
23. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 5 of 19
24. (debark car6 loc8)
   deleted: (on car6)
   added: (at car6 loc8) (empty-ferry)
   goals met: 6 of 19
25. (sail loc8 loc13)
   deleted: (at-ferry loc8)
   added: (at-ferry loc13)
   goals met: 6 of 19
26. (board car7 loc13)
   deleted: (at car7 loc13) (empty-ferry)
   added: (on car7)
   goals met: 6 of 19
27. (sail loc13 loc6)
   deleted: (at-ferry loc13)
   added: (at-ferry loc6)
   goals met: 6 of 19
28. (debark car7 loc6)
   deleted: (on car7)
   added: (at car7 loc6) (empty-ferry)
   goals met: 7 of 19
29. (board car8 loc6)
   deleted: (at car8 loc6) (empty-ferry)
   added: (on car8)
   goals met: 7 of 19
30. (sail loc6 loc4)
   deleted: (at-ferry loc6)
   added: (at-ferry loc4)
   goals met: 7 of 19
31. (debark car8 loc4)
   deleted: (on car8)
   added: (at car8 loc4) (empty-ferry)
   goals met: 8 of 19
32. (sail loc4 loc1)
   deleted: (at-ferry loc4)
   added: (at-ferry loc1)
   goals met: 8 of 19
33. (board car9 loc1)
   deleted: (at car9 loc1) (empty-ferry)
   added: (on car9)
   goals met: 8 of 19
34. (sail loc1 loc4)
   deleted: (at-ferry loc1)
   added: (at-ferry loc4)
   goals met: 8 of 19
35. (debark car9 loc4)
   deleted: (on car9)
   added: (at car9 loc4) (empty-ferry)
   goals met: 9 of 19
36. (sail loc4 loc6)
   deleted: (at-ferry loc4)
   added: (at-ferry loc6)
   goals met: 9 of 19
37. (board car10 loc6)
   deleted: (at car10 loc6) (empty-ferry)
   added: (on car10)
   goals met: 9 of 19
38. (sail loc6 loc8)
   deleted: (at-ferry loc6)
   added: (at-ferry loc8)
   goals met: 9 of 19
39. (debark car10 loc8)
   deleted: (on car10)
   added: (at car10 loc8) (empty-ferry)
   goals met: 10 of 19
40. (sail loc8 loc3)
   deleted: (at-ferry loc8)
   added: (at-ferry loc3)
   goals met: 10 of 19
41. (board car11 loc3)
   deleted: (at car11 loc3) (empty-ferry)
   added: (on car11)
   goals met: 10 of 19
42. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 10 of 19
43. (debark car11 loc5)
   deleted: (on car11)
   added: (at car11 loc5) (empty-ferry)
   goals met: 11 of 19
44. (sail loc5 loc7)
   deleted: (at-ferry loc5)
   added: (at-ferry loc7)
   goals met: 11 of 19
45. (board car12 loc7)
   deleted: (at car12 loc7) (empty-ferry)
   added: (on car12)
   goals met: 11 of 19
46. (sail loc7 loc14)
   deleted: (at-ferry loc7)
   added: (at-ferry loc14)
   goals met: 11 of 19
47. (debark car12 loc14)
   deleted: (on car12)
   added: (at car12 loc14) (empty-ferry)
   goals met: 12 of 19
48. (sail loc14 loc5)
   deleted: (at-ferry loc14)
   added: (at-ferry loc5)
   goals met: 12 of 19
49. (board car13 loc5)
   deleted: (at car13 loc5) (empty-ferry)
   added: (on car13)
   goals met: 12 of 19
50. (sail loc5 loc15)
   deleted: (at-ferry loc5)
   added: (at-ferry loc15)
   goals met: 12 of 19
51. (debark car13 loc15)
   deleted: (on car13)
   added: (at car13 loc15) (empty-ferry)
   goals met: 13 of 19
52. (sail loc15 loc14)
   deleted: (at-ferry loc15)
   added: (at-ferry loc14)
   goals met: 13 of 19
53. (board car14 loc14)
   deleted: (at car14 loc14) (empty-ferry)
   added: (on car14)
   goals met: 13 of 19
54. (sail loc14 loc11)
   deleted: (at-ferry loc14)
   added: (at-ferry loc11)
   goals met: 13 of 19
55. (debark car14 loc11)
   deleted: (on car14)
   added: (at car14 loc11) (empty-ferry)
   goals met: 14 of 19
56. (sail loc11 loc7)
   deleted: (at-ferry loc11)
   added: (at-ferry loc7)
   goals met: 14 of 19
57. (board car15 loc7)
   deleted: (at car15 loc7) (empty-ferry)
   added: (on car15)
   goals met: 14 of 19
58. (sail loc7 loc6)
   deleted: (at-ferry loc7)
   added: (at-ferry loc6)
   goals met: 14 of 19
59. (debark car15 loc6)
   deleted: (on car15)
   added: (at car15 loc6) (empty-ferry)
   goals met: 15 of 19
60. (sail loc6 loc1)
   deleted: (at-ferry loc6)
   added: (at-ferry loc1)
   goals met: 15 of 19
61. (board car16 loc1)
   deleted: (at car16 loc1) (empty-ferry)
   added: (on car16)
   goals met: 15 of 19
62. (sail loc1 loc10)
   deleted: (at-ferry loc1)
   added: (at-ferry loc10)
   goals met: 15 of 19
63. (debark car16 loc10)
   deleted: (on car16)
   added: (at car16 loc10) (empty-ferry)
   goals met: 16 of 19
64. (sail loc10 loc9)
   deleted: (at-ferry loc10)
   added: (at-ferry loc9)
   goals met: 16 of 19
65. (board car17 loc9)
   deleted: (at car17 loc9) (empty-ferry)
   added: (on car17)
   goals met: 16 of 19
66. (sail loc9 loc5)
   deleted: (at-ferry loc9)
   added: (at-ferry loc5)
   goals met: 16 of 19
67. (debark car17 loc5)
   deleted: (on car17)
   added: (at car17 loc5) (empty-ferry)
   goals met: 17 of 19
68. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 17 of 19
69. (board car18 loc8)
   deleted: (at car18 loc8) (empty-ferry)
   added: (on car18)
   goals met: 17 of 19
70. (sail loc8 loc14)
   deleted: (at-ferry loc8)
   added: (at-ferry loc14)
   goals met: 17 of 19
71. (debark car18 loc14)
   deleted: (on car18)
   added: (at car18 loc14) (empty-ferry)
   goals met: 18 of 19
72. (sail loc14 loc10)
   deleted: (at-ferry loc14)
   added: (at-ferry loc10)
   goals met: 18 of 19
73. (board car19 loc10)
   deleted: (at car19 loc10) (empty-ferry)
   added: (on car19)
   goals met: 18 of 19
74. (sail loc10 loc7)
   deleted: (at-ferry loc10)
   added: (at-ferry loc7)
   goals met: 18 of 19
75. (debark car19 loc7)
   deleted: (on car19)
   added: (at car19 loc7) (empty-ferry)
   goals met: 19 of 19
